import { TermsData } from "../../../components/Terms/types";


export const data: TermsData[] = [
    {
        type: 'title',
        title: '서비스 이용약관 (상품, 서비스 등 이용 일반 회원용)',
    },
    {
        type: 'article',
        articleContents: [
            {
                type: 'article-title',
                title: '제1조(목적)',
            },
            {
                type: 'contents',
                contents:
                    "본 약관은 크롤에서 제공하는 서비스(이하 '서비스'라 합니다)를 이용함에 있어 당사자의 권리 의무 및 책임사항을 규정하는 것을 목적으로 합니다.",
            },
        ],
    },
    {
        type: 'article',
        articleContents: [
            {
                type: 'article-title',
                title: '제2조(정의)',
            },
            {
                type: 'contents',
                contents:
                    "'크롤'라 함은, 소셜 플랫폼 어플리케이션입니다. '이용자'라 함은, '앱'에 접속하여 본 약관에 따라 '크롤'이 제공하는 서비스를 받는 회원 및 비회원을 말합니다. '회원'이라 함은, '크롤'에 개인정보를 제공하고 회원으로 등록한 자로서, '크롤'의 서비스를 계속하여 이용할 수 있는 자를 말합니다. '비회원'이라 함은, 회원으로 등록하지 않고, '크롤'이 제공하는 서비스를 이용하는 자를 말합니다.",
            },
        ],
    },
    {
        type: 'article',
        articleContents: [
            {
                type: 'article-title',
                title: '제3조(약관 외 준칙)',
            },
            {
                type: 'contents',
                contents:
                    "본 약관에서 정하지 아니한 사항은 법령 또는 크롤가 정한 서비스의 개별 약관, 운영정책 및 규칙(이하 '세부지침'이라 합니다)의 규정에 따릅니다. 또한 본 약관과 세부지침이 충돌할 경우에는 세부지침이 우선합니다.",
            },
        ],
    },
    {
        type: 'article',
        articleContents: [
            {
                type: 'article-title',
                title: '제4조(약관의 명시 및 개정)',
            },
            {
                type: 'list',
                list: [
                    {
                        contents:
                            "'크롤'은 이 약관의 내용과 상호 및 대표자 성명, 전화번호 등을 이용자가 쉽게 알 수 있도록 '크롤' 서비스화면에 게시합니다. 다만 본 약관의 내용은 '이용자'가 연결화면을 통하여 확인할 수 있도록 할 수 있습니다.",
                    },
                    {
                        contents:
                            "'크롤'이 본 약관을 개정하고자 할 경우, 적용일자 및 개정사유를 명시하여 현행약관과 함께 앱에 그 적용일자 7일전부터 적용일자 전날까지 공지합니다. 다만, '이용자'에게 불리한 내용으로 약관을 변경하는 경우 최소 30일 이상 유예기간을 두고 공지합니다.",
                    },
                    {
                        contents:
                            "'크롤'이 본 약관을 개정한 경우, 개정약관은 적용일자 이후 체결되는 계약에만 적용되며 적용일자 이전 체결된 계약에 대해서는 개정 전 약관이 적용됩니다. 다만, 이미 계약을 체결한 '이용자'가 개정약관의 내용을 적용받고자 하는 뜻을 '크롤'에 전달하고 '크롤'이 여기에 동의한 경우 개정약관을 적용합니다.",
                    },
                    {
                        contents:
                            '본 약관에서 정하지 아니한 사항 및 본 약관의 해석에 관하여는 관계법령 및 건전한 상관례에 따릅니다.',
                    },
                ],
            },
        ],
    },
    {
        type: 'article',
        articleContents: [
            {
                type: 'article-title',
                title: '제5조(서비스의 중단 등)',
            },

            {
                type: 'list',
                list: [
                    {
                        contents:
                            "'크롤'이 제공하는 서비스는 연중무휴, 1일 24시간 제공을 원칙으로 합니다. 다만 '크롤' 시스템의 유지 · 보수를 위한 점검, 통신장비의 교체 등 특별한 사유가 있는 경우 서비스의 전부 또는 일부에 대하여 일시적인 제공 중단이 발생할 수 있습니다.",
                    },
                    {
                        contents:
                            "'크롤'은 전시, 사변, 천재지변 또는 이에 준하는 국가비상사태가 발생하거나 발생할 우려가 있는 경우, 전기통신사업법에 의한 기간통신사업자가 전기통신서비스를 중지하는 등 부득이한 사유가 발생한 경우 서비스의 전부 또는 일부를 제한하거나 중지할 수 있습니다.",
                    },
                    {
                        contents:
                            "'크롤'이 서비스를 정지하거나 이용을 제한하는 경우 그 사유 및 기간, 복구 예정 일시 등을 지체 없이 '이용자'에게 알립니다.",
                    },
                ],
            },
        ],
    },
    {
        type: 'article',
        articleContents: [
            {
                type: 'article-title',
                title: '제6조(회원가입)',
            },

            {
                type: 'list',
                list: [
                    {
                        contents:
                            "'크롤'이 정한 양식에 따라 '이용자'가 회원정보를 기입한 후 본 약관에 동의한다고 간주함으써 회원가입을 신청합니다.",
                    },
                    {
                        contents:
                            "'크롤'은 전항에 따라 회원가입을 신청한 '이용자' 중 다음 각호의 사유가 없는 한 '회원'으로 등록합니다.",
                        children: {
                            contents: [
                                "가입신청자가 본 약관에 따라 회원자격을 상실한 적이 있는 경우. 다만, '크롤'의 재가입 승낙을 얻은 경우에는 예외로 합니다.",
                                '회원정보에 허위, 기재누락, 오기 등 불완전한 부분이 있는 경우',
                                "기타 회원으로 등록하는 것이 '크롤'의 운영에 현저한 지장을 초래하는 것으로 인정되는 경우",
                            ],
                        },
                    },
                    { contents: "회원가입 시기는 '크롤'의 가입승낙 안내가 '회원'에게 도달한 시점으로 합니다." },
                ],
            },
        ],
    },
    {
        type: 'article',
        articleContents: [
            {
                type: 'article-title',
                title: '제7조(회원탈퇴 및 자격상실 등)',
            },
            {
                type: 'list',
                list: [
                    {
                        contents:
                            "'회원'은 '크롤'에 언제든지 탈퇴를 요청할 수 있으며, '크롤'은 지체없이 회원탈퇴 요청을 처리합니다.",
                    },
										{
												contents:
														"회원 복원시 계정 활성을 위해 필요한 닉넥임을 제외한 나머지 정보는 별도로 저장 및 관리됩니다. 다만, 관계법령에 의해 보존할 필요가 있는 경우 '크롤'은 정해진 기간 동안 회원정보를 보관합니다."
										}
                ],
            },
        ],
    },
    {
        type: 'article',
        articleContents: [
            {
                type: 'article-title',
                title: '제8조(개인정보보호)',
            },
            {
                type: 'list',
                list: [
                    {
                        contents:
                            "'크롤'은 '이용자'의 정보수집시 다음의 필수사항 등 회원가입 이행에 필요한 최소한의 정보만을 수집합니다.",
                        children: {
                            contents: ['닉네임'],
                        },
                    },
                    {
                        contents:
                            "'크롤'이 개인정보보호법 상의 고유식별정보 및 민감정보를 수집하는 때에는 반드시 대상자의 동의를 받습니다.",
                    },
                    {
                        contents:
                            '통계작성, 학술연구 또는 시장조사를 위하여 필요한 경우로서 특정 개인을 식별할 수 없는 형태로 제공하는 경우',
                    },
                    { contents: '도용방지를 위하여 본인 확인이 필요한 경우' },
                    { contents: '관계법령의 규정에 따른 경우' },
                    {
                        contents:
                            "본 약관에 기재된 사항 이외의 개인정보보호에 관항 사항은 '크롤'의 '개인정보처리방침'에 따릅니다.",
                    },
                ],
            },
        ],
    },
    {
        type: 'article',
        articleContents: [
            {
                type: 'article-title',
                title: "제9조('크롤'의 의무)",
            },
            {
                type: 'list',
                list: [
                    {
                        contents:
                            "'크롤'은 '이용자'가 안전하게 인터넷 서비스를 이용할 수 있도록 개인정보(신용정보 포함)보호를 위한 보안 시스템을 갖추어야 합니다.",
                    },
                    {
                        contents:
                            "'크롤'은 '이용자'의 수신동의 없이 영리목적으로 광고성 전자우편, 휴대전화 메시지, 전화, 우편 등을 발송하지 않습니다.",
                    },
                ],
            },
        ],
    },
    {
        type: 'article',
        articleContents: [
            {
                type: 'article-title',
                title: '제10조(이용자 및 회원의 의무)',
            },
            {
                type: 'list',
                list: [
                    {
                        contents:
                            "'이용자'는 회원가입 신청 시 사실에 근거하여 신청서를 작성해야 합니다. 허위, 또는 타인의 정보를 등록한 경우 '크롤'에 대하여 일체의 권리를 주장할 수 없으며, '크롤'은 이로 인하여 발생한 손해에 대하여 책임을 부담하지 않습니다.",
                    },
                    {
                        contents:
                            "'이용자'는 본 약관에서 규정하는 사항과 기타 '크롤'이 정한 제반 규정 및 공지사항을 준수하여야 합니다. 또한 '이용자'는 '크롤'의 업무를 방해하는 행위 및 '크롤'의 명예를 훼손하는 행위를 하여서는 안 됩니다.",
                    },
                    {
                        contents:
                            "'이용자'는 주소, 연락처, 전자우편 주소 등 회원정보가 변경된 경우 즉시 이를 수정해야 합니다. 변경된 정보를 수정하지 않거나 수정을 게을리하여 발생하는 책임은 '이용자'가 부담합니다.",
                    },
                    {
                        contents: "'이용자'는 다음의 행위를 하여서는 안됩니다.",
                        children: {
                            contents: [
                                "'크롤'에 게시된 정보의 변경",
                                "'크롤'이 정한 정보 외의 다른 정보의 송신 또는 게시",
                                "'크롤' 및 제3자의 저작권 등 지식재산권에 대한 침해",
                                "'크롤' 및 제3자의 명예를 훼손하거나 업무를 방해하는 행위",
                                "외설 또는 폭력적인 메시지, 화상, 음성 기타 관계법령 및 공서양속에 반하는 정보를 '크롤'의 '사이트'에 공개 또는 게시하는 행위",
                            ],
                        },
                    },
                    {
                        contents:
                            "'회원'이 자신의 회원정보를 도난당하거나 제3자가 사용하고 있음을 인지한 경우에는 바로 '크롤'에 통보하고 안내에 따라야 합니다.",
                    },
                ],
            },
        ],
    },
    {
        type: 'article',
        articleContents: [
            {
                type: 'article-title',
                title: '제11조(저작권의 귀속 및 이용)',
            },
            {
                type: 'list',
                list: [
                    {
                        contents: "'크롤'이 제공하는 서비스 및 이와 관련된 모든 지식재산권은 '크롤'에 귀속됩니다",
                    },
                    {
                        contents:
                            "'이용자'는 '쇼핑몰'에게 지식재산권이 있는 정보를 사전 승낙없이 복제, 송신, 출판, 배포, 방송 기타 방법에 의하여 영리목적으로 이용하거나, 제3자가 이용하게 하여서는 안됩니다.",
                    },
                    {
                        contents:
                            "'이용자'가 서비스 내에 게시한 게시물, 이용후기 등 콘텐츠(이하 '콘텐츠')의 저작권은 해당 '콘텐츠'의 저작자에게 귀속됩니다.",
                    },
                    {
                        contents:
                            "전항의 규정에도 불구하고 '크롤'은 서비스의 운영, 전시, 전송, 배포, 홍보 등의 목적으로 별도의 허락 없이 무상으로 저작권법 및 공정한 거래관행에 합치되는 범위 내에서 다음 각호와 같이 '이용자'가 등록한 저작물을 이용할 수 있습니다.",
                        children: {
                            contents: [
                                '서비스의 운영, 홍보, 서비스 개선 및 새로운 서비스 개발을 위한 범위내의 사용',
                                "미디어, 통신사 등을 통한 홍보목적으로 '콘텐츠'를 제공, 전시하도록 하는 등의 사용",
                            ],
                        },
                    },
                ],
            },
        ],
    },
    {
        type: 'article',
        articleContents: [
            {
                type: 'article-title',
                title: '제12조(분쟁의 해결)',
            },
            {
                type: 'list',
                list: [
                    {
                        contents:
                            "'크롤'은 '이용자'가 제기하는 불만사항 및 의견을 지체없이 처리하기 위하여 노력합니다. 다만 신속한 처리가 곤란한 경우 '이용자'에게 그 사유와 처리일정을 즉시 통보해 드립니다.",
                    },
                    {
                        contents:
                            "'크롤'와 '이용자'간 발생한 분쟁에 관한 소송은 민사소송법에 따른 관할법원에 제기하며, 준거법은 대한민국의 법령을 적용합니다.",
                    },
                ],
            },
        ],
    },
    {
        type: 'effective-date',
        date: '2023.12.28',
    },
];